<?php include 'header.php' ?>
  <section class="page">
        <h1>Задание на курсовой проект</h1>
        <p>В рамках курсового проекта необходимо разработать программное приложение на языке С++ в парадигме объектно-ориентированного программирования. Приложение должно частично автоматизировать работу сотрудников некоего вымышленного предприятия.</p>
        <h2>План работы</h2>
        <ol>
          <li>Выбрать предметную область из вариантов приведенных в таблице. В одной группе вариант не может быть выбран более 2 раз. Сбор информации о выбранных вариантах возлагается на старост групп.</li>
          <table>
            <tr>
              <th>Вариант</th>
              <th>Предметная область</th>
            </tr>
            <tr><td>1</td><td>Гостиница</td></tr>
            <tr><td>2</td><td>Книжный магазин</td></tr>
            <tr><td>3</td><td>Цветочный магазин</td></tr>
            <tr><td>4</td><td>Магазин виниловых пластинок</td></tr>
            <tr><td>5</td><td>Туристическое агенство</td></tr>
            <tr><td>6</td><td>Детективное агенство</td></tr>
            <tr><td>7</td><td>Автосервис</td></tr>
            <tr><td>8</td><td>Пекарня</td></tr>
            <tr><td>9</td><td>Салон красоты</td></tr>
            <tr><td>10</td><td>Аэропорт</td></tr>
            <tr><td>11</td><td>Библиотека</td></tr>
            <tr><td>12</td><td>Аптека</td></tr>
            <tr><td>13</td><td>Отдел кадров</td></tr>
          </table>
          <li>Составить описание предметной области, выделить её основные сущности. Например, для предметной области &laquo;гостиница&raquo; необходимо описать основные бизнес-процессы гостиницы, выделить сущности &laquo;администратор (портье)&raquo;, &laquo;гость&raquo;, &laquo;номер&raquo; и т.д.</li>
          <li>Составить описание приложения, т.е. Сформулировать назначение приложения, определить основных пользователей системы, описать их работу и выделить основные функции приложения. Для предметной области &laquo;гостиница&raquo; назначением приложения может быть автоматизация оформления гостей, пользователем системы может быть администратор (портье), а основными функциями &ndash; вывод информации о свободных номерах, вывод информации о госте (если он уже был клиентом гостиницы), ввод данных о госте (если он посещает гостиницу первый раз) и т.д.</li>
          <li>На основании п.2 и п.3 определить какие классы должны быть разработанны как они взаимодействуют, есть-ли наследование, какие свойства они должны иметь и какие методы они должны реализовывать. Необходимо визуализировать диаграмму классов в нотации UML и произвести их описание.</li>
          <li>Написание кода.</li>
          <li>Оформление проекта.</li>
        </ol>
        <h2>Требования к приложению</h2>
        <p>Приложение должно позволять просматривать данные, создавать данные, редактировать данные и удалять их. Например, для предметной области &laquo;гостиница&raquo;, приложение должно применять все вышеперечисленные операции для данных о гостях и номерном фонде.</p>
        <p>Интерфейс приложения &ndash; консольный. Создание графический интерфейса &ndash; по желанию.</p>
        <p>Хранение данных производится в текстовых файлах. Организация хранения &ndash; один файл один объект.</p>
        <p>Приложение должно быть заполнено данными в объеме, необходимом для демонстрации его функционала.</p>
        <h2>Оформление проекта</h2>
        <p>В соответствии с ГОСТ 7.32-2001 и ГОСТ 2.105-95.</p>
      </section>
</body>
</html>
