<?php include 'header.php' ?>
	<section class="page">
			<article>
				<h1>Любите C++ таким, какой он есть.</h1>
				<q>Узрите великую мощь С++, здесь нет места ##### как в С. Дойдем до Python вообще дзен познаем.</q>
				<p>Цель работы: Изучение принципов алгоритмизации линейных вычислительных процессов. Исследование структуры программ, типов данных. Получение навыков отладки программ.</p>
				<h2>Задание 1</h2>
				<p>С клавиатуры вводится произвольное целое четырехзначное число (например – 7824. Необходимо вывести на экран числа из которых оно состоит в обратном порядке (в примере – 4287).</p>
				<h2>Задание 2</h2>
				<p>С клавиатуры вводится сумма депозита и количество месяцев хранения денег в банке. Необходимо провести расчет и показать на экран прибыль с депозита в месяц, за весь срок депозита, и общую сумму к выплате в конце срока. Валюта – Российский рубль. Процентная ставка – 6,6% годовых.</p>
			</article>
	<footer>

	</footer>
</body>
<script src="js/rainbow-custom.min.js"></script>
<script src="js/c.js"></script>
</html>
