<?php include 'header.php' ?>
	<section class="page">
			<article>
				<h1>Циклы ваше все. While (live = true) {you.prepareToDie}</h1>
				<p>Цель работы: Освоить работу с операторами циклов и ветвлений на языке программирования C++. Написать программы с использованием операторов for и switch.</p>
				<h2>Задание 1</h2>
				<p>Найти конечное значение суммы, положенной на депозит под сложный процент (хз, как ещё сформулировать).</p>
				<h2>Задание 2</h2>
				<p>Создать калькулятор, выполняющий с двумя числами простые арифметические операции: сумма, разность, умножение, деление. Для создания меню использовать оператор switch().</p>
				<h2>Задание 3</h2>
				<p>Реализовать программу выводящую на экран пирамиду их символов x, по типу:</p>
				<pre>
        X
      XXX
    XXXXX
  XXXXXXX
XXXXXXXXX
				</pre>
			</article>
	<footer>

	</footer>
</body>
<script src="js/rainbow-custom.min.js"></script>
<script src="js/c.js"></script>
</html>
