<?php include 'header.php' ?>
	<section class="page">
			<article>
				<h1>Функции С++</h1>
				<p>Цель работы: Создать функциональную функцию.</p>
				<h2>Задание 1</h2>
				<p>Возведение числа n в степень p - это умножение числа n на себя p раз. Напишите функцию с именем power(),
					которая в качестве аргументов принимает значение типа double для n и значение типа int для p и возвращает значение типа double.
					Для аргугумента, соответствующего степени числа, задайте значение по умолчанию, равное 2, чтобы при отсутствии показателя степени при вызове функции число n возводилось в квадрат.
					Напишите функцию main(), которая запрашивает у пользователя ввод аргументов для функции power(), и отобразите на экране результат ее работы.</p>
				<h2>Задание 2</h2>
				<p>Взяв в качестве основы функцию power() из первой  задачи, работающую только	со значением типа double, создайте перегруженные функции с этим же именем, 
					принимающими в качестве аргумента значения типа char, int, long и float.
					Напишите программу, вызывающую функцию power() со всеми возможными типами аргументов.</p>
				<h2>Задание 3</h2>
				<p>Напишите функцию, которая при каждом вызове будет выводить на экран количество раз,
					которое она вызывалась ранее. Напишите программу, которая будет вызывать данную функцию не менее 10 раз.
					Попробуйте реализовать данную функцию двумя различными способами: с использованием глобальной переменной и статической локальной переменной для
					хранения числа вызовов функции.</p>
			</article>
	<footer>

	</footer>
</body>
<script src="js/rainbow-custom.min.js"></script>
<script src="js/c.js"></script>
</html>
