<?php include 'header.php' ?>
	<section class="page">
			<article>
				<h1>ООП в деле</h1>
				<p>Цель работы: Научиться создавать классы.</p>
				<h2>Задание 1</h2>
				<p>Создайте класс​ Int, имитирующий стандартный тип​ int. Единственное​ поле этого класса должно иметь тип​ int. Создайте методы, которые будут​ устанавливать значение поля,​ равным нулю, инициализировать его целым​ значением, выводить значение поля на экран и складывать два значения типа​ Int.</p>
        <p>Напишите программу, в которой будут созданы три объекта класса​ Int,​ два из которых будут инициализированы. Сложите два инициализированных объекта, присвойте​ результат третьему, а затем отобразите результат​ на экране.</p>
				<h2>Задание 2</h2>
				<p>Создайте класс с именем​ time, содержащий три поля типа​ int, предназначенные для хранения часов, минут и секунд. Один из конструкторов класса должен​ инициализировать поля нулевыми значениями, а другой конструктор -​ заданным набором значений. Создайте метод класса, который​ будет выводить значения полей на​ экран в формате чч:мм:сс, и метод,​ складывающий значения двух объектов типа​ time, передаваемых в качестве аргументов.</p>
				<p>В функции​ main()​ следует создать два инициализированных объекта​ и один неинициализированный объект. Затем​ сложите два инициализированных значения, а результат присвойте третьему объекту и выведите его значение на экран.</p>
				<h2>Задание 3</h2>
				<p>Создайте класс​ employee. Класс должен​ включать поле типа​ int​ для хранения номера сотрудника и поле типа​ float​ для хранения​ величины его оклада. Методы класса должны позволять​ пользователю вводить и отображать данные класса. Напишите функцию​ main(), которая запросит​ пользователя ввести данные для трех сотрудников и выведет полученную информацию на экран.</p>

				<h1>Теория на YouTube ;)</h1>
				<h2><a href="https://vk.com/doc268909357_548774817?hash=9128737e8de9635417&dl=020eec2435ac3a0e77" target="_blank">Ну или тут</a></h2>
      </article>
	<footer>

	</footer>
</body>
<script src="js/rainbow-custom.min.js"></script>
<script src="js/c.js"></script>
</html>
