<?php include 'header.php' ?>
	<section class="page">
			<article>
				<h1>Массивы и строки</h1>
				<p>Цель работы:Создать массивный .</p>
				<h2>Задание 1</h2>
        Напишите функцию reversit(), которая переворачивает строку (массив типа char).
        Используйте цикл for, который меняет местами первый и последний символы, затем следующие и т. д. до предпоследнего.
        Строка должна передаваться в функцию reversit() как аргумент.
        Напишите программу для выполнения функции reversit().
        Программа должна принимать строку от пользователя, вызывать функцию reversit(), а затем выводить полученный результат.
        Используйте метод ввода, который позволяет использовать внутренние пробелы. Протестируйте программу на примере любой фразы-палиндрома.</p>
				<h2>Задание 2</h2>
				<p>Начните с программы, которая позволяет пользователю вводить целые числа, а затем сохранять их в массиве типа int.
        Напишите функцию maxint(), которая, обрабатывая элементы массива один за другим, находит наибольший.
        Функция должна принимать в качестве аргумента адрес массива и количество элементов в нем, а возвращать индекс наибольшего элемента.
        Программа должна вызвать эту функцию, а затем вывести наибольший элемент и его индекс.</p>
				<h2>Задание 3</h2>
				<p> Недостатком C++ является отсутствие автоматической проверки индексов массива на соответствие их границам массива (это делает действия с массивами быстрыми, но менее надежными).
        Мы можем использовать класс для создания надежного массива, который проверяет индексы при любой попытке доступа к массиву.

        Напишите класс, который использует массив типа int фиксированного размера в качестве своей единственной переменной.
        В классе будет два метода. Первый - принимает индекс и значение типа int как аргументы и вставляет это значение в массив по заданному индексу.
        Второй - принимает индекс как аргумент и возвращает значение типа int, содержащееся в элементе с этим индексом.</p>
        <p>Оба метода должны проверять индекс аргумента, чтобы быть уверенными, что он не меньше 0 и не больше, чем заданный размер массива.</p>
        <div class="script">
          <div class="script-article"><span>C++</span></div>
          <pre><code data-language="c">
safearay sa1; // описываем массив
int temp = 12345; // описываем размер
sa1.putel(7, temp); // помещаем значение temp в массив
temp = sa1.getel(7); // получаем значение из массива
          </code></pre>
        </div>
				<h2><a href="includes/theory.pdf" target="_blank">Теория</a></h2>
      </article>
	<footer>

	</footer>
</body>
<script src="js/rainbow-custom.min.js"></script>
<script src="js/c.js"></script>
</html>
