<?php include 'header.php' ?>
	<section class="page">
			<article>
				<h1>Наследование</h1>
				<p>Цель работы: Изучить наследование.</p>
        <h2>Задание 1</h2>
        <p>Создадим прототип системы учета книг и их аудио-версий.
        Создайте класс publication, в котором хранятся название (строка) и цена (типа float) книги.
        От этого класса наследуются еще два класса: book, который содержит информацию о количестве страниц в книге (типа int), и type, который содержит время записи книги в минутах (тип float).
        В каждом из этих трех классов должен быть метод getdata(), через который можно получать данные от пользователя с клавиатуры, и putdata(), предназначенный для вывода этих данных.
        Напишите функцию main() программы для проверки классов book и type.<br>
        Создайте их объекты в программе и запросите пользователя ввести и вывести данные с использованием методов getdata() и putdata().</p>
				<h2>Задание 2</h2>
				<p>Начните с классов book, type и publication из упражнения 1.
        Добавьте базовый класс sales, в котором содержится массив, состоящий из трех значений типа float, куда можно записать общую стоимость проданных книг за последние три месяца.
        Включите в класс методы getdata() для получения значений стоимости от пользователя и putdata() для вывода этих цифр.
        Измените классы book и type так, чтобы они стали производными обоих классов: publications и sales.
        Объекты классов book и type должны вводить и выводить данные о продажах вместе с другими своими данными.
        Напишите функцию main() для создания объектов классов book и type, чтобы протестировать возможности ввода/вывода данных.</p>
				<h2><a href="https://ravesli.com/urok-153-nasledovanie-vvedenie/" target="_blank">Можно здесь почитать, что как</a></h2>
      </article>
	<footer>

	</footer>
</body>
<script src="js/rainbow-custom.min.js"></script>
<script src="js/c.js"></script>
</html>
